In [2]:
import pandas as pd
import numpy as np

tmp = [10, 20, 30, 40, 50]
s1 = pd.Series(tmp)

print("리스트로 생성")
print(s1)

리스트로 생성
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
s1.dtype

dtype('int64')

In [ ]:
s2 = pd.Series(tmp,
               index=['김철수', '김영희', '김행근', '익명', '이제석'],
               name='점수')
print(s2)

# 기본적으로 할당되는 인덱스 : range index

# labeled : unique할 필요가 없음 / 같은 인덱스 값을 가질 수 있음

김철수    10
김영희    20
김행근    30
익명     40
이제석    50
Name: 점수, dtype: int64

In [3]:
s2 = pd.Series(tmp,
               index=['김철수', '김영희', '김행근', '이제석', '이제석'],
               name='점수')
print(s2)

김철수    10
김영희    20
김행근    30
이제석    40
이제석    50
Name: 점수, dtype: int64

In [6]:
s2.loc["이제석"]

이제석    40
이제석    50
Name: 점수, dtype: int64

In [ ]:
dict_data = {'서울': 9765, '부산': 3419, '인천': 2958, '대구': 2427}
s3 = pd.Series(dict_data)

print(s3)

서울    9765
부산    3419
인천    2958
대구    2427
dtype: int64

In [ ]:
print(f'값(values) : {s2. values}')
print(f'인덱스(index) : {s2.index}')
print(f'이름( : {s2.name}')
print(f'크기(size) : {s2.size}')
print(f'데이터타입(dtype) : {s2.dtype}')

값(values) : [10 20 30 40 50]
인덱스(index) : Index(['김철수', '김영희', '김행근', '이제석', '이제석'], dtype='object')
이름(name) : 점수
크기(size) : 5
데이터타입(dtype) : int64

In [16]:
print(type(s2.dtype))

<class 'numpy.dtypes.Int64DType'>

In [17]:
print(s2['이제석'])

이제석    40
이제석    50
Name: 점수, dtype: int64

In [18]:
print(s2.iloc[0])

10

In [22]:
print(s2[['김철수', '김행근']])

김철수    10
김행근    30
Name: 점수, dtype: int64

In [29]:
print(s2.iloc[[0, 3]])

김철수    10
이제석    40
Name: 점수, dtype: int64

In [30]:
s2.iloc[0]

np.int64(10)

In [32]:
s2.iloc[0] + s2.iloc[2]

np.int64(40)

In [ ]:
# boolean mask (예도 결국 Series)

s2 >= 30

김철수    False
김영희    False
김행근     True
이제석     True
이제석     True
Name: 점수, dtype: bool

In [39]:
print('students who have a score over 30')
print(s2[s2 >= 30])

print('\nstudents who have score between 20 and 30')
print(s2[(s2 >= 20) & (s2 <= 30)])

students who have a score over 30
김행근    30
이제석    40
이제석    50
Name: 점수, dtype: int64

students who have score between 20 and 30
김영희    20
김행근    30
Name: 점수, dtype: int64

In [ ]:
import pandas as pd
import numpy as np

data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최동욱'],
    '나이': [25, 30, 35, 28, 32],
    '도시': ['서울', '부산', '서울', '대구', '부산'],
    '점수': [85, 92, 78, 95, 88]
}

df = pd.DataFrame(data)
print(df)

    이름  나이  도시  점수
0  김철수  25  서울  85
1  이영희  30  부산  92
2  박민수  35  서울  78
3  정수진  28  대구  95
4  최동욱  32  부산  88

In [ ]:
df.describe

<bound method NDFrame.describe of     이름  나이  도시  점수
0  김철수  25  서울  85
1  이영희  30  부산  92
2  박민수  35  서울  78
3  정수진  28  대구  95
4  최동욱  32  부산  88>

In [7]:
import pandas as pd

# 기준 DataFrame
base = pd.DataFrame({"이름": pd.Series(["엘리스", "밥", "찰리"], index=[
                    100, 101, 102], dtype="string")})

# 각각 일부 인덱스를 가진 Series
age_s = pd.Series([25, 30], index=[100, 101], name="나이", dtype="Int64")
city_s = pd.Series(["서울", "부산", "인천"], index=[100, 102, 103],
                   name="도시", dtype="string")

# Series를 DataFrame으로 변환
df = pd.concat([base, age_s.to_frame(), city_s.to_frame()],
               axis=1)

df.index = df.index * 10

print(df)

        이름    나이    도시
1000   엘리스    25    서울
1010     밥    30  <NA>
1020    찰리  <NA>    부산
1030  <NA>  <NA>    인천

In [ ]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    # "Age" : [25, 30, 35, 40.],
    "City": ["Seoul", "Busan", "Incheon", "Daegu"],
}

# df = pd.DataFrame(data, dtype="string")
df = pd.DataFrame(data)

print("Shape:", df.shape)
print("ndim:", df.ndim)
print("Size:", df.size)
print("dtypes:", df.dtypes)
print("Index:", df.index)
print("Columns:", df.columns)

Shape: (4, 3)
ndim: 2
Size: 12
dtypes: Name    object
Age      int64
City    object
dtype: object
Index: RangeIndex(start=0, stop=4, step=1)
Columns: Index(['Name', 'Age', 'City'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [43]:
desc = df.describe(include="all")

In [44]:
desc

         Name        Age   City
count       4   4.000000      4
unique      4        NaN      4
top     Alice        NaN  Seoul
freq        1        NaN      1
mean      NaN  32.500000    NaN
std       NaN   6.454972    NaN
min       NaN  25.000000    NaN
25%       NaN  28.750000    NaN
50%       NaN  32.500000    NaN
75%       NaN  36.250000    NaN
max       NaN  40.000000    NaN

In [47]:
# desc.iloc[0]
desc.loc['count']

Name      4
Age     4.0
City      4
Name: count, dtype: object

In [53]:
type(desc.iloc[[0]])

pandas.core.frame.DataFrame

In [55]:
print(df.head())
print(df.tail(2))

      Name  Age     City
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu
      Name  Age     City
2  Charlie   35  Incheon
3    David   40    Daegu

In [57]:
tmp = desc.head(2)

In [ ]:
tmp = desc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, count to max
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     8 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 652.0+ bytes

In [60]:
type(tmp)

NoneType

In [72]:
for idx, i in df.iterrows():
  # print(type(i[1]))
  # print(i[1].iloc[0])
  print(idx, " ")
  print(type(i))
  print(i)
  print("-"*10)

0
<class 'pandas.core.series.Series'>
Name    Alice
Age        25
City    Seoul
Name: 0, dtype: object
----------
1
<class 'pandas.core.series.Series'>
Name      Bob
Age        30
City    Busan
Name: 1, dtype: object
----------
2
<class 'pandas.core.series.Series'>
Name    Charlie
Age          35
City    Incheon
Name: 2, dtype: object
----------
3
<class 'pandas.core.series.Series'>
Name    David
Age        40
City    Daegu
Name: 3, dtype: object
----------

In [78]:
df.columns

Index(['이름', '나이', '도시'], dtype='object')

In [74]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [76]:
df.columns = ['이름', '나이', '도시']

In [79]:
df.index = [str(x) for x in range(10, 14)]

In [80]:
df

         이름  나이       도시
10    Alice  25    Seoul
11      Bob  30    Busan
12  Charlie  35  Incheon
13    David  40    Daegu

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 10 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   도시      4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [83]:
df.set_index("이름")

         나이       도시
이름
Alice    25    Seoul
Bob      30    Busan
Charlie  35  Incheon
David    40    Daegu

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 10 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   도시      4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [85]:
df2 = df.set_index("이름")

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Alice to David
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   나이      4 non-null      int64
 1   도시      4 non-null      object
dtypes: int64(1), object(1)
memory usage: 96.0+ bytes

In [ ]:
df2.reset_index(drop=True)

   나이       도시
0  25    Seoul
1  30    Busan
2  35  Incheon
3  40    Daegu

In [90]:
df['이름']

10      Alice
11        Bob
12    Charlie
13      David
Name: 이름, dtype: object